[
    {
        "text": "Emily was Chris' first love.",
        "probability": 1
    },
    {
        "text": "Chris met Emily in first year of university, she was his floormate.",
        "probability": 1
    },
    {
        "text": "They became best friends and spent countless hours together.",
        "probability": 1
    },
    {
        "text": "Chris was trying to be someone he was not, and she felt the disconnect.",
        "probability": 1
    },
    {
        "text": "Chris kissed her in first year, and she said it was the most sincere kiss of her life.",
        "probability": 1
    },
    {
        "text": "Chris wanted her so badly that he didn't see that she wanted him.",
        "probability": 1
    },
    {
        "text": "Emily came to a party Chris hosted. She stayed behind with Chris; they took a walk and she hugged him after he pretended to scare her, but the surprise made Chris push her away.",
        "probability": 1
    },
    {
        "text": "Emily and Chris went camping, tried to catch fish, bought fish when they didn't, and Chris told stories in the tent... Chris recalls the joke 'pitter patter click'.",
        "probability": 1
    },
    {
        "text": "Chris was exploring consciousness with substances, and that pushed her away.",
        "probability": 3
    },
    {
        "text": "Chris made friends with her friends, moved in with them, all in the hopes that he would see Emily more.",
        "probability": 3
    },
    {
        "text": "Chris saw Emily more, but she had boyfriends and the heartache was too much.",
        "probability": 3
    },
    {
        "text": "Chris still tried to help, and donated to her anonymously. Her boyfriend at the time, Lars found out, and Chris thinks he accidentally broke them up.",
        "probability": 3
    },
    {
        "text": "Chris always dreamt that they could reconnect, but she is now on the other side of the world... Chris believes at least... and Chris thinks Emily was told misinformation about him. Chris thinks Emily is someone who would see through that.",
        "probability": 2
    },
    {
        "text": "Chris painted many paintings that were inspired by emotions Emily made him feel.",
        "probability": 2
    }
]